In [1]:
import sys

In [2]:
sys.version_info

sys.version_info(major=3, minor=7, micro=3, releaselevel='final', serial=0)

In [3]:
if sys.platform == 'darwin' :
    print(" Mac OS")
else :
    print(" Windows ")

 Mac OS

# 1. 그룹화 처리

     특정 열의 값들을 범주화해서 분리하고 이를 기준으로 계산한 집계를 표시할 수 있습니다.
     
     집계 계산도 특정 열 단위로 처리도 가능합니다.

### 시본 데이터 가져오기

In [4]:
import seaborn as sns

In [5]:
tips = sns.load_dataset("tips")

In [6]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [7]:
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [8]:
tips.ndim

2

In [9]:
tips.shape

(244, 7)

## 1-1 특정 열을 기준으로 그룹화


    만약 키가 지정하는 조건에 맞는 데이터가 하나 이상이라서 데이터 그룹을 이루는 경우에는 그룹의 특성을 보여주는 그룹분석(group analysis)을 한다.

    그룹분석은 피봇테이블과 달리 키에 의해서 결정되는 데이터가 여러개가 있을 경우 미리 지정한 연산을 통해 그 그룹 데이터의 대표값을 계산한. Pandas에서는 groupby 명령을 사용하여 다음처럼 그룹분석을 한다.

    분석하고자 하는 시리즈나 데이터프레임에 groupby 메서드를 호출하여 그룹화를 한다.
    그룹 객체에 대해 그룹연산을 수행한다.


    groupby 메서드¶

    groupby 메서드는 데이터를 그룹 별로 분류하는 역할을 한다. groupby 메서드의 인수로는 다음과 같은 값을 사용한다.

        - 열 또는 열의 리스트
        - 행 인덱스
        
        
    연산 결과로 그룹 데이터를 나타내는 GroupBy 클래스 객체를 반환한다. 이 객체에는 그룹별로 연산을 할 수 있는 그룹연산 메서드가 있다.

In [10]:
t_gr = tips.groupby('sex')

### 그룹화하면 별로의 클래스의 객체가 생성됩니다.

In [11]:
t_gr

### 그룹화 객체의 속성 알아보기

In [12]:
t_gr_Male = t_gr.get_group('Male')

In [13]:
type(t_gr_Male)

pandas.core.frame.DataFrame

### 그룹화 내부의 값을 가져오기

In [14]:
t_gr.groups['Male']

Int64Index([  1,   2,   3,   5,   6,   7,   8,   9,  10,  12,
            ...
            231, 232, 233, 234, 235, 236, 237, 239, 241, 242],
           dtype='int64', length=157)

In [15]:
t_gr_Female = t_gr.get_group('Female')

In [16]:
type(t_gr_Female)

pandas.core.frame.DataFrame

In [17]:
t_gr.groups['Female']

Int64Index([  0,   4,  11,  14,  16,  18,  21,  22,  29,  32,  33,  37,  51,
             52,  57,  66,  67,  71,  72,  73,  74,  82,  85,  92,  93,  94,
            100, 101, 102, 103, 104, 109, 111, 114, 115, 117, 118, 119, 121,
            124, 125, 127, 128, 131, 132, 133, 134, 135, 136, 137, 139, 140,
            143, 144, 145, 146, 147, 155, 157, 158, 162, 164, 168, 169, 178,
            186, 188, 191, 197, 198, 201, 202, 203, 205, 209, 213, 214, 215,
            219, 221, 223, 225, 226, 229, 238, 240, 243],
           dtype='int64')

## 1-2 그룹화된 데이터를 가지고 계산하기

       그룹화한 객체에서 제공되는 메소드가 있고 추가적인 메소드를 사용하려면 agg 메소드 내부에 메소드나 함수를 지정해서 처리가 가능합니다.
       또한 딕셔너리로 지정하면 열별로 별도의 계산도 가능합니다.
       
       그룹연산 메서드¶

    groupby 결과, 즉 GroupBy 클래스 객체의 뒤에 붙일 수 있는 그룹연산 메서드는 다양하다. 다음은 자주 사용되는 그룹연산 메서드들이다.

     size, count: 그룹 데이터의 갯수
    mean, median, min, max: 그룹 데이터의 평균, 중앙값, 최소, 최대
    sum, prod, std, var, quantile : 그룹 데이터의 합계, 곱, 표준편차, 분산, 사분위수
    first, last: 그룹 데이터 중 가장 첫번째 데이터와 가장 나중 데이터
    이 외에도 많이 사용되는 것으로는 다음과 같은 그룹연산이 있다.
    
    
    agg, aggregate

            만약 원하는 그룹연산이 없는 경우 함수를 만들고 이 함수를 agg에 전달한다.
            또는 여러가지 그룹연산을 동시에 하고 싶은 경우 함수 이름 문자열의 리스트를 전달한다.
    describe

            하나의 그룹 대표값이 아니라 여러개의 값을 데이터프레임으로 구한다.
    apply

            describe 처럼 하나의 대표값이 아닌 데이터프레임을 출력하지만 원하는 그룹연산이 없는 경우에 사용한다.
    transform

            그룹에 대한 대표값을 만드는 것이 아니라 그룹별 계산을 통해 데이터 자체를 변형한다.

### 합산과 건수를 처리해서 평균 처리

In [18]:
t_gr_s = t_gr.sum()

In [19]:
t_gr_c = t_gr.count()

In [20]:
t_gr_s / t_gr_c

        day      size  smoker  time       tip  total_bill
sex
Male    NaN  2.630573     NaN   NaN  3.089618   20.744076
Female  NaN  2.459770     NaN   NaN  2.833448   18.056897

### 평균처리하기

In [21]:
t_gr.mean()

        total_bill       tip      size
sex
Male     20.744076  3.089618  2.630573
Female   18.056897  2.833448  2.459770

### 특정 열만 검색하기

In [22]:
t_gr.mean()['total_bill']

sex
Male      20.744076
Female    18.056897
Name: total_bill, dtype: float64

## 1-3 agg 집계 메소드를 이용해서 다양한 함수를 처리

### 메소드들을 리스트에 넣어서 여러 개 적용

In [23]:
t_gr.agg(['count','sum','mean','std','var'])

       total_bill                                            tip          \
            count      sum       mean       std        var count     sum
sex
Male          157  3256.82  20.744076  9.246469  85.497185   157  485.07
Female         87  1570.95  18.056897  8.009209  64.147429    87  246.51

                                      size
            mean       std       var count  sum      mean       std       var
sex
Male    3.089618  1.489102  2.217424   157  413  2.630573  0.955997  0.913931
Female  2.833448  1.159495  1.344428    87  214  2.459770  0.937644  0.879177

### 특정 열별로 메소드 적용을 위해 딕셔너리 사용

In [24]:
t_gr.agg({'total_bill':'count','tip':'sum'})

        total_bill     tip
sex
Male           157  485.07
Female          87  246.51

## 1-4 특정 그룹화 후에 행의 값을 변경하기

In [25]:
tips_ = tips.copy()

In [26]:
tips_.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

### 모든 행이 다 계산됨

In [27]:
tips_ = tips_.groupby('sex').transform(lambda x : x * 1000)

In [28]:
tips_.head()

   total_bill     tip  size
0     16990.0  1010.0  2000
1     10340.0  1660.0  3000
2     21010.0  3500.0  3000
3     23680.0  3310.0  2000
4     24590.0  3610.0  4000

### 특정 열의 모든 행 계산하기

In [29]:
tips_ = tips.copy()

In [30]:
tips_['total_bill'] = tips_.groupby('sex')['total_bill'].transform(lambda x : x * 1000)

In [31]:
tips_.head()

   total_bill   tip     sex smoker  day    time  size
0     16990.0  1.01  Female     No  Sun  Dinner     2
1     10340.0  1.66    Male     No  Sun  Dinner     3
2     21010.0  3.50    Male     No  Sun  Dinner     3
3     23680.0  3.31    Male     No  Sun  Dinner     2
4     24590.0  3.61  Female     No  Sun  Dinner     4

## 1-5 필터링 처리하기

In [32]:
tips_f = tips.copy()

In [33]:
tips_f.groupby('sex').count()

        total_bill  tip  smoker  day  time  size
sex
Male           157  157     157  157   157   157
Female          87   87      87   87    87    87

In [34]:
tips_f.groupby('sex').mean()

        total_bill       tip      size
sex
Male     20.744076  3.089618  2.630573
Female   18.056897  2.833448  2.459770

### 그룹된 기준에서 필터링 하기

     특정 그룹이 필터 메소드 내에 로직에 합당하면 그룹화된 모든 데이터만 추출됩니다.

In [35]:
tips_f.shape

(244, 7)

In [36]:
tips_mean = tips_f.groupby('sex').filter(lambda x : x['total_bill'].mean() >= 20.0 )

In [37]:
tips_mean.shape

(157, 7)

In [38]:
tips_mean_ = tips_f.groupby('sex').filter(lambda x : x['total_bill'].mean() < 20.0 )

In [39]:
tips_mean_.shape

(87, 7)